Manual.html
<div id="outline-container-org4bda775" class="outline-3">
<h3 id="org4bda775"><span class="section-number-3">2.2</span> yavdr07-headless.yml</h3>
<div class="outline-text-3" id="text-2-2">
<p>
For a headless server installation <code>yavdr07-headless.yml</code> is a good choice
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file: yavdr07-headless.yml</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">this playbook set up a headless yaVDR 0.7 installation</span>

- <span style="color: #BA36A5;">name</span>: set up a headless yaVDR server
  <span style="color: #BA36A5;">hosts</span>: all
  <span style="color: #BA36A5;">become</span>: <span style="color: #D0372D;">true</span>
  <span style="color: #BA36A5;">roles</span>:
    - yavdr-common
    - vdr
    - yavdr-network
    - samba-server
    - samba-config
    - nfs-server
    - grub-config
    - autoinstall-satip
  <span style="color: #BA36A5;">handlers</span>:
    - <span style="color: #BA36A5;">include</span>: handlers/main.yml
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge584ca4" class="outline-2">
<h2 id="orge584ca4"><span class="section-number-2">3</span> Hosts</h2>
<div class="outline-text-2" id="text-3">
<p>
This playbook can either be used to run the installation on the localhost or any other PC in the network that can be accessed via ssh. Simply add the host names or IP addresses to the hosts file in the respective section:
</p>

<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #6434A3;">yavdr-full</span>]
<span style="color: #BA36A5;">localhost connection</span>=local
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">192.168.1.116</span>

[<span style="color: #6434A3;">yavdr-headless</span>]

[<span style="color: #6434A3;">yavdr-client</span>]
</pre>
</div>
</div>
</div>
<div id="outline-container-org699a94d" class="outline-2">
<h2 id="org699a94d"><span class="section-number-2">4</span> Group Variables</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org036c3a8" class="outline-3">
<h3 id="org036c3a8"><span class="section-number-3">4.1</span> default text for templates</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file: group_vars/all</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">this is the standard text to put in templates</span>
<span style="color: #BA36A5;">ansible_managed_file</span>: <span style="color: #008000;">"*** YAVDR: ANSIBLE MANAGED FILE ***"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org607ed13" class="outline-3">
<h3 id="org607ed13"><span class="section-number-3">4.2</span> PPAs</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">branch</span>: unstable
<span style="color: #BA36A5;">ppa_owner</span>: <span style="color: #008000;">'ppa:yavdr'</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">a list of all package repositories to be added to the installation</span>
<span style="color: #BA36A5;">repositories</span>:
  - <span style="color: #008000;">'{{ ppa_owner }}/main'</span>
  - <span style="color: #008000;">'{{ ppa_owner }}/unstable-main'</span>
  - <span style="color: #008000;">'{{ ppa_owner }}/{{branch}}-vdr'</span>
  - <span style="color: #008000;">'{{ ppa_owner }}/{{branch}}-yavdr'</span>
  - <span style="color: #008000;">'{{ ppa_owner }}/{{branch}}-kodi'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0a10651" class="outline-3">
<h3 id="org0a10651"><span class="section-number-3">4.3</span> VDR user, directories, special configuration and plugins</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">properties of the user vdr and vdr-related options</span>
<span style="color: #BA36A5;">vdr</span>:
  <span style="color: #BA36A5;">user</span>: vdr
  <span style="color: #BA36A5;">group</span>: vdr
  <span style="color: #BA36A5;">uid</span>: 666
  <span style="color: #BA36A5;">gid</span>: 666
  <span style="color: #BA36A5;">home</span>: /var/lib/vdr
  <span style="color: #BA36A5;">recdir</span>: /srv/vdr/video
  <span style="color: #BA36A5;">hide_first_recording_level</span>: <span style="color: #D0372D;">false</span>
  <span style="color: #BA36A5;">safe_dirnames</span>: true  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">escape characters (useful for windows clients and FAT/NTFS file systems)</span>
  <span style="color: #BA36A5;">override_vdr_charset</span>: <span style="color: #D0372D;">false</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">add the vdr plugins you want to install</span>
<span style="color: #BA36A5;">vdr_plugins</span>:
  - vdr-plugin-devstatus
  - vdr-plugin-markad
  - vdr-plugin-restfulapi
  - vdr-plugin-softhddevice
</pre>
</div>
</div>
</div>
<div id="outline-container-org264cd80" class="outline-3">
<h3 id="org264cd80"><span class="section-number-3">4.4</span> Media directories</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">dictionary of directories for (shared) files. Automatically exported via NFS and Samba if those roles are enabled</span>
<span style="color: #BA36A5;">media_dirs</span>:
  <span style="color: #BA36A5;">audio</span>: /srv/audio
  <span style="color: #BA36A5;">video</span>: /srv/audio
  <span style="color: #BA36A5;">pictures</span>: /srv/picture
  <span style="color: #BA36A5;">files</span>: /srv/files
  <span style="color: #BA36A5;">backups</span>: /srv/backups
  <span style="color: #BA36A5;">recordings</span>: <span style="color: #008000;">'{{ vdr.recdir }}'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab7fcd1" class="outline-3">
<h3 id="orgab7fcd1"><span class="section-number-3">4.5</span> NFS</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">nfs</span>:
  <span style="color: #BA36A5;">insecure</span>: false  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">set to true for OS X clients or if you plan to use libnfs as unprivileged user (e.g. KODI)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org63138b9" class="outline-3">
<h3 id="org63138b9"><span class="section-number-3">4.6</span> Samba</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">samba</span>:
  <span style="color: #BA36A5;">workgroup</span>: YAVDR
  <span style="color: #BA36A5;">windows_compatible</span>: <span style="color: #008000;">'{{ vdr.safe_dirnames }}'</span>  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">set to true to disable unix extensions, enable follow symlinks and wide links</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac81f07" class="outline-3">
<h3 id="orgac81f07"><span class="section-number-3">4.7</span> Additional packages</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">additional packages you want to install</span>
<span style="color: #BA36A5;">extra_packages</span>:
  - vim
  - tree
  - w-scan
  - bpython3
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd987214" class="outline-3">
<h3 id="orgd987214"><span class="section-number-3">4.8</span> System pre-configuration</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">system:</span>
<span style="color: #8D8D84;">#  </span><span style="color: #8D8D84; font-style: italic;">shutdown: poweroff</span>
<span style="color: #BA36A5;">grub</span>:
  <span style="color: #BA36A5;">timeout</span>: 0
  <span style="color: #BA36A5;">boot_options</span>: quiet nosplash
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org96e8b82" class="outline-2">
<h2 id="org96e8b82"><span class="section-number-2">5</span> Roles</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org6bf8358" class="outline-3">
<h3 id="org6bf8358"><span class="section-number-3">5.1</span> yavdr-common</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This role is used to set up a basic yaVDR installation. It creates the directories, installs the vdr and other useful packages.
</p>
</div>
<div id="outline-container-org1c45a5f" class="outline-4">
<h4 id="org1c45a5f"><span class="section-number-4">5.1.1</span> default variables</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
This section is for reference only, please use the files in <code>global_vars</code> for customizations.
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file: roles/yavdr-common/defaults/main.yml</span>
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="org25d699a"></a>Repositories<br /><div class="outline-text-5" id="text-5-1-1-1">
<p>
You can set a list of package repositories which provide the necessary packages. Feel free to use own PPAs if you need special customization to the VDR and it&rsquo;s plugins.
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">branch</span>: unstable
<span style="color: #BA36A5;">repositories</span>:
  - <span style="color: #008000;">'ppa:yavdr/main'</span>
  - <span style="color: #008000;">'ppa:yavdr/unstable-main'</span>
  - <span style="color: #008000;">'ppa:yavdr/{{branch}}-vdr'</span>
  - <span style="color: #008000;">'ppa:yavdr/{{branch}}-kodi'</span>
  - <span style="color: #008000;">'ppa:yavdr/{{branch}}-yavdr'</span>
</pre>
</div>
</div></li>
<li><a id="org3ff2ac2"></a>Drivers<br /><div class="outline-text-5" id="text-5-1-1-2">
<p>
Automatically installed drivers can be very useful, but if you know you need a certain driver, you can simply set it&rsquo;s value to <b>true</b>. If you don&rsquo;t want a driver to be installed, set it&rsquo;s value to <b>false</b>.
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">drivers</span>:
  <span style="color: #BA36A5;">sundtek</span>: auto
  <span style="color: #BA36A5;">ddvb-dkms</span>: auto
</pre>
</div>
</div></li>
