Manual.html
<li><a id="orgc295c26"></a>Additional Packages<br /><div class="outline-text-5" id="text-5-1-1-3">
<p>
Add additional packages you would like to have on your installation to this list
</p>
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #BA36A5;">extra_packages</span>:
      - vim
      - tree
      - w-scan
</pre>
</div>
</div></li>
<li><a id="org38eb168"></a>VDR<br /><div class="outline-text-5" id="text-5-1-1-4">
<p>
This section allows you to set the recording directory, the user and group that runs the vdr and it&rsquo;s home directory.
</p>
<dl class="org-dl">
<dt>user</dt><dd>the vdr user name</dd>
<dt>group</dt><dd>the main group for the user vdr</dd>
<dt>uid</dt><dd>the user id for the user vdr</dd>
<dt>gid</dt><dd>the group id for the group vdr</dd>
<dt>home</dt><dd>the home directory for the user vdr</dd>
<dt>recdir</dt><dd>the recording directory used by VDR</dd>
<dt>hide_first_recording_level</dt><dd>let vdr hide the first directory level of it&rsquo;s recording directory so the content of multiple directories is shown merged together</dd>
<dt>safe_dirnames</dt><dd>replace special characters which are not compatible with Windows file systems and Samba shares</dd>
<dt>override_vdr_charset</dt><dd>workaround for channels with weird EPG encodings, e.g. Sky</dd>
</dl>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">vdr</span>:
    <span style="color: #BA36A5;">user</span>: vdr
    <span style="color: #BA36A5;">group</span>: vdr
    <span style="color: #BA36A5;">uid</span>: 666
    <span style="color: #BA36A5;">gid</span>: 666
    <span style="color: #BA36A5;">home</span>: /var/lib/vdr
    <span style="color: #BA36A5;">recdir</span>: /srv/vdr/video
    <span style="color: #BA36A5;">hide_first_recording_level</span>: <span style="color: #D0372D;">false</span>
    <span style="color: #BA36A5;">safe_dirnames</span>: <span style="color: #D0372D;">true</span>
    <span style="color: #BA36A5;">override_vdr_charset</span>: <span style="color: #D0372D;">false</span>
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-org59b02dd" class="outline-4">
<h4 id="org59b02dd"><span class="section-number-4">5.1.2</span> tasks</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
yavdr-common executes the following tasks:
</p>
</div>
<ol class="org-ol"><li><a id="org840648a"></a>main.yml<br /><ol class="org-ol"><li><a id="org3f8dc72"></a>Disable default installation of recommended packages<br /><div class="outline-text-6" id="text-5-1-2-1-1">
<p>
This task prevents apt to automatically install all recommended dependencies for packages:
</p>
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: apt | prevent automatic installation of recommended packages
  <span style="color: #BA36A5;">template</span>:
    <span style="color: #BA36A5;">src</span>: templates/90-norecommends.j2
    <span style="color: #BA36A5;">dest</span>: /etc/apt/apt.conf.d/90norecommends
</pre>
</div>
</div></li>
<li><a id="orgf331aaf"></a>Use bash instead of dash<br /><div class="outline-text-6" id="text-5-1-2-1-2">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: use bash instead of dash
  <span style="color: #BA36A5;">shell</span>: |
    echo <span style="color: #008000;">"set dash/sh false"</span> | debconf-communicate
<span style="color: #008000;">    dpkg-reconfigure -f noninteractive dash</span>
</pre>
</div>
</div></li>

<li><a id="orga0be0b8"></a>create user vdr<br /></li>
<li><a id="orgee924f8"></a>Disable release-upgrade notifications<br /><div class="outline-text-6" id="text-5-1-2-1-4">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: disable release-upgrade notifications
  <span style="color: #BA36A5;">lineinfile</span>:
    <span style="color: #BA36A5;">dest</span>: /etc/update-manager/release-upgrades
    <span style="color: #BA36A5;">backrefs</span>: <span style="color: #D0372D;">yes</span>
    <span style="color: #BA36A5;">state</span>: present
    <span style="color: #BA36A5;">regexp</span>: <span style="color: #008000;">'^(Prompt=).*$'</span>
    <span style="color: #BA36A5;">line</span>: <span style="color: #008000;">'\1never'</span>
</pre>
</div>
</div></li>
<li><a id="org251f9bd"></a>Set up package repositories<br /><div class="outline-text-6" id="text-5-1-2-1-5">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: add yaVDR PPAs
  <span style="color: #BA36A5;">apt_repository</span>:
      <span style="color: #BA36A5;">repo</span>: <span style="color: #008000;">'{{ item }}'</span>
      <span style="color: #BA36A5;">state</span>: present
      <span style="color: #BA36A5;">update_cache</span>: <span style="color: #D0372D;">yes</span>
  <span style="color: #BA36A5;">with_items</span>: <span style="color: #008000;">'{{ repositories }}'</span>

- <span style="color: #BA36A5;">name</span>: upgrade existing packages
  <span style="color: #BA36A5;">apt</span>:
      <span style="color: #BA36A5;">upgrade</span>: dist
      <span style="color: #BA36A5;">update_cache</span>: <span style="color: #D0372D;">yes</span>
</pre>
</div>
</div></li>
<li><a id="org77654d9"></a>Install essential packages<br /><div class="outline-text-6" id="text-5-1-2-1-6">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: apt | install basic packages
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: <span style="color: #008000;">'{{ item }}'</span>
    <span style="color: #BA36A5;">state</span>: present
    <span style="color: #BA36A5;">install_recommends</span>: <span style="color: #D0372D;">no</span>
  <span style="color: #BA36A5;">with_items</span>:
    - anacron
    - at
    - bash-completion
    - biosdevname
    - linux-firmware
    - psmisc
    - python-kmodpy
    - python-usb
    - python3-usb
    - software-properties-common
    - ssh
    - ubuntu-drivers-common
    - wget
    - wpasupplicant
    - usbutils
    - xfsprogs
</pre>
</div>
</div></li>
<li><a id="orgd850884"></a>Install additional packages (user defined)<br /><div class="outline-text-6" id="text-5-1-2-1-7">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: apt | install extra packages
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: <span style="color: #008000;">'{{ item }}'</span>
    <span style="color: #BA36A5;">state</span>: present
    <span style="color: #BA36A5;">install_recommends</span>: <span style="color: #D0372D;">no</span>
  <span style="color: #BA36A5;">with_items</span>:
      <span style="color: #008000;">'{{ extra_packages }}'</span>
</pre>
</div>
</div></li>
<li><a id="orge400ae3"></a>Gather facts with custom modules<br /><div class="outline-text-6" id="text-5-1-2-1-8">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: get information about usb and pci hardware and loaded kernel modules
  <span style="color: #BA36A5;">hardware_facts</span>:
    <span style="color: #BA36A5;">usb</span>: <span style="color: #D0372D;">True</span>
    <span style="color: #BA36A5;">pci</span>: <span style="color: #D0372D;">True</span>
    <span style="color: #BA36A5;">modules</span>: <span style="color: #D0372D;">True</span>
    <span style="color: #BA36A5;">gpus</span>: <span style="color: #D0372D;">True</span>
- <span style="color: #BA36A5;">debug</span>:
    <span style="color: #BA36A5;">var</span>: usb
    <span style="color: #BA36A5;">verbosity</span>: 1
- <span style="color: #BA36A5;">debug</span>:
    <span style="color: #BA36A5;">var</span>: pci
    <span style="color: #BA36A5;">verbosity</span>: 1
- <span style="color: #BA36A5;">debug</span>:
    <span style="color: #BA36A5;">var</span>: modules
    <span style="color: #BA36A5;">verbosity</span>: 1
- <span style="color: #BA36A5;">debug</span>:
    <span style="color: #BA36A5;">var</span>: gpus
    <span style="color: #BA36A5;">verbosity</span>: 1
</pre>
</div>
</div></li>
<li><a id="org76e094a"></a>create media directories<br /></li></ol></li></ol>
</div>
<div id="outline-container-org8a864e2" class="outline-4">
<h4 id="org8a864e2"><span class="section-number-4">5.1.3</span> templates</h4>
<div class="outline-text-4" id="text-5-1-3">
<div class="org-src-container">
<pre class="src src-c">{{ ansible_managed_file | comment(<span style="color: #008000;">'c'</span>) }}
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Recommends are as of now still abused in many packages</span>
APT::Install-Recommends <span style="color: #008000;">"0"</span>;
APT::Install-Suggests <span style="color: #008000;">"0"</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc61ca47" class="outline-3">
<h3 id="orgc61ca47"><span class="section-number-3">5.2</span> vdr</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-orga3052e4" class="outline-4">
<h4 id="orga3052e4"><span class="section-number-4">5.2.1</span> tasks</h4>
<div class="outline-text-4" id="text-5-2-1">
</div><ol class="org-ol"><li><a id="orgfd0b0f8"></a>install the basic vdr packages<br /><div class="outline-text-5" id="text-5-2-1-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file: roles/vdr/tasks/main.yml</span>

- <span style="color: #BA36A5;">name</span>: apt | install basic vdr packages
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: <span style="color: #008000;">'{{ item }}'</span>
    <span style="color: #BA36A5;">state</span>: present
    <span style="color: #BA36A5;">install_recommends</span>: <span style="color: #D0372D;">no</span>
  <span style="color: #BA36A5;">with_items</span>:
    - vdr
    - vdrctl
    - vdr-plugin-dbus2vdr
</pre>
</div>
</div></li>
