Manual.html
<li><a id="org7937a3b"></a>Add svdrp/svdrp-disc to /etc/services<br /><div class="outline-text-5" id="text-5-2-1-2">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: add svdrp to /etc/services
  <span style="color: #BA36A5;">lineinfile</span>:
    <span style="color: #BA36A5;">dest</span>: /etc/services
    <span style="color: #BA36A5;">state</span>: present
    <span style="color: #BA36A5;">line</span>: <span style="color: #008000;">"svdrp        6419/tcp"</span>

- <span style="color: #BA36A5;">name</span>: add svdrp-disc to /etc/services
  <span style="color: #BA36A5;">lineinfile</span>:
    <span style="color: #BA36A5;">dest</span>: /etc/services
    <span style="color: #BA36A5;">state</span>: present
    <span style="color: #BA36A5;">line</span>: <span style="color: #008000;">"svdrp-disc       6419/udp"</span>
</pre>
</div>
</div></li>
<li><a id="org444180c"></a>Set up the recording directory for the vdr user<br /><div class="outline-text-5" id="text-5-2-1-3">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: create vdr recdir
  <span style="color: #BA36A5;">file</span>:
    <span style="color: #BA36A5;">state</span>: directory
    <span style="color: #BA36A5;">owner</span>: <span style="color: #008000;">'{{ vdr.user }}'</span>
    <span style="color: #BA36A5;">group</span>: <span style="color: #008000;">'{{ vdr.group }}'</span>
    <span style="color: #BA36A5;">mode</span>: 0775
    <span style="color: #BA36A5;">dest</span>: <span style="color: #008000;">'{{ vdr.recdir }}'</span>

- <span style="color: #BA36A5;">name</span>: set option to use hide-first-recording-level patch
  <span style="color: #BA36A5;">blockinfile</span>:
    <span style="color: #BA36A5;">dest</span>: /etc/vdr/conf.d/04-vdr-hide-first-recordinglevel.conf
    <span style="color: #BA36A5;">create</span>: <span style="color: #D0372D;">true</span>
    <span style="color: #BA36A5;">block</span>: |
      <span style="color: #008000;">[vdr]</span>
<span style="color: #008000;">      --hide-first-recording-level</span>
  <span style="color: #BA36A5;">when</span>:
    vdr.hide_first_recording_level

- <span style="color: #BA36A5;">name</span>: create local dir in recdir
  <span style="color: #BA36A5;">file</span>:
    <span style="color: #BA36A5;">state</span>: directory
    <span style="color: #BA36A5;">owner</span>: <span style="color: #008000;">'{{ vdr.user }}'</span>
    <span style="color: #BA36A5;">group</span>: <span style="color: #008000;">'{{ vdr.group }}'</span>
    <span style="color: #BA36A5;">mode</span>: <span style="color: #008000;">'0775'</span>
    <span style="color: #BA36A5;">dest</span>: <span style="color: #008000;">'{{ vdr.recdir }}/local'</span>
  <span style="color: #BA36A5;">when</span>:
    vdr.hide_first_recording_level

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">TODO: set recdir, user etc. in /etc/vdr/conf.d/</span>
</pre>
</div>
</div></li>
<li><a id="orga330177"></a>Install additional vdr plugins<br /><div class="outline-text-5" id="text-5-2-1-4">
<p>
The additional plugins to install can be set in the variable <code>{{vdr_plugins}}</code> in the group variables
</p>
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: apt | install additional vdr plugins
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: <span style="color: #008000;">'{{ item }}'</span>
    <span style="color: #BA36A5;">state</span>: present
    <span style="color: #BA36A5;">install_recommends</span>: <span style="color: #D0372D;">no</span>
  <span style="color: #BA36A5;">with_items</span>:
    <span style="color: #008000;">'{{ vdr_plugins | default({}) }}'</span>
  <span style="color: #BA36A5;">notify</span>: [ <span style="color: #008000;">'Restart VDR'</span> ]
</pre>
</div>
</div></li></ol>
</div>
</div>
<div id="outline-container-org21e294a" class="outline-3">
<h3 id="org21e294a"><span class="section-number-3">5.3</span> <span class="todo STARTED">STARTED</span> yavdr-network</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-orga62d9b5" class="outline-4">
<h4 id="orga62d9b5"><span class="section-number-4">5.3.1</span> default variables</h4>
<div class="outline-text-4" id="text-5-3-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">install_avahi</span>: <span style="color: #D0372D;">true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org586df8d" class="outline-4">
<h4 id="org586df8d"><span class="section-number-4">5.3.2</span> tasks</h4>
<div class="outline-text-4" id="text-5-3-2">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">this playbook sets up network services for a yaVDR installation</span>
<span style="color: #8D8D84;">#</span>
- <span style="color: #BA36A5;">name</span>: install network packages
  <span style="color: #BA36A5;">apt</span>:
      <span style="color: #BA36A5;">name</span>: <span style="color: #008000;">'{{ item }}'</span>
      <span style="color: #BA36A5;">state</span>: present
      <span style="color: #BA36A5;">install_recommends</span>: <span style="color: #D0372D;">no</span>
  <span style="color: #BA36A5;">with_items</span>:
      - avahi-daemon
      - avahi-utils
      - biosdevname
      - ethtool
      - nfs-common
      - vdr-addon-avahi-linker
      - wakeonlan

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Does this really work? We need a way to check if an interface supports WOL - Python Skript?</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">- name: check WOL capabilities of network interfaces</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">shell: 'ethtool {{ item }} | grep -Po "(?&lt;=Supports\sWake-on:\s).*$"'</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">register: wol</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">with_items: '{% for interface in ansible_interfaces if interface != 'lo' and interface != 'bond0' %}'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2db8d9f" class="outline-3">
<h3 id="org2db8d9f"><span class="section-number-3">5.4</span> <span class="todo STARTED">STARTED</span> nfs-server</h3>
<div class="outline-text-3" id="text-5-4">
</div><div id="outline-container-orga4c8a45" class="outline-4">
<h4 id="orga4c8a45"><span class="section-number-4">5.4.1</span> tasks</h4>
<div class="outline-text-4" id="text-5-4-1">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: install and configure nfs-kernel-server
  <span style="color: #BA36A5;">apt</span>:
      <span style="color: #BA36A5;">name</span>: <span style="color: #008000;">"{{ item }}"</span>
      <span style="color: #BA36A5;">state</span>: present
      <span style="color: #BA36A5;">install_recommends</span>: <span style="color: #D0372D;">no</span>
  <span style="color: #BA36A5;">with_items</span>:
      - nfs-kernel-server
  <span style="color: #BA36A5;">when</span>:
      - <span style="color: #008000;">'{{ install_nfs_server }}'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org647ff11" class="outline-3">
<h3 id="org647ff11"><span class="section-number-3">5.5</span> <span class="todo TODO">TODO</span> yavdr-remote</h3>
<div class="outline-text-3" id="text-5-5">
</div><div id="outline-container-org2261f01" class="outline-4">
<h4 id="org2261f01"><span class="section-number-4">5.5.1</span> default variables</h4>
</div>
<div id="outline-container-orge8907f5" class="outline-4">
<h4 id="orge8907f5"><span class="section-number-4">5.5.2</span> tasks</h4>
</div>
<div id="outline-container-org0b22d09" class="outline-4">
<h4 id="org0b22d09"><span class="section-number-4">5.5.3</span> templates</h4>
</div>
<div id="outline-container-orga19091b" class="outline-4">
<h4 id="orga19091b"><span class="section-number-4">5.5.4</span> files</h4>
</div>
</div>
<div id="outline-container-orgc59c3f1" class="outline-3">
<h3 id="orgc59c3f1"><span class="section-number-3">5.6</span> <span class="todo TODO">TODO</span> automatic X-server configuration</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> detect connected display</li>
<li class="off"><code>[&#xa0;]</code> read EDID from displays</li>
<li class="off"><code>[&#xa0;]</code> create a xorg.conf for nvidia/intel/amd gpus</li>
</ul>
</div>
<div id="outline-container-org86d7340" class="outline-4">
<h4 id="org86d7340"><span class="section-number-4">5.6.1</span> templates</h4>
<div class="outline-text-4" id="text-5-6-1">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file: roles/yavdr-xorg/templates/vdr-xorg.conf</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">{{ ansible_managed_file }}</span>

[<span style="color: #6434A3;">Unit</span>]
<span style="color: #BA36A5;">After</span>=x@vt7.service
<span style="color: #BA36A5;">Wants</span>=x@vt7.service
<span style="color: #BA36A5;">BindsTo</span>=x@vt7.service
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">!/bin/</span><span style="color: #0000FF;">bash</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">{{ ansible_managed_file }}</span>
<span style="color: #0000FF;">exec</span> openbox-session
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">env | grep <span style="color: #008000;">"DISPLAY\|DBUS_SESSION_BUS_ADDRESS\|XDG_RUNTIME_DIR"</span> &gt; ~/.session-env
systemctl --user import-environment
</pre>
</div>
</div>
</div>
