Manual.html
<div id="outline-container-org0a2db2b" class="outline-4">
<h4 id="org0a2db2b"><span class="section-number-4">5.11.2</span> templates</h4>
<div class="outline-text-4" id="text-5-11-2">
</div><ol class="org-ol"><li><a id="org718baf1"></a>smb.conf<br /><ol class="org-ol"><li><a id="org6af1c4f"></a>global settings<br /><div class="outline-text-6" id="text-5-11-2-1-1">
<div class="org-src-container">
<pre class="src src-yaml">{{ ansible_managed_file | comment }}

<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">======================= Global Settings =======================</span>

[global]

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Browsing/Identification ###</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Change this to the workgroup/NT-domain name your Samba server will part of</span>
   workgroup = {{ samba.workgroup }}

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">server string is the equivalent of the NT Description field</span>
   server string = %h server (Samba, Ubuntu)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">This will prevent nmbd to search for NetBIOS names through DNS.</span>
   dns proxy = no

<span style="color: #8D8D84;">#### </span><span style="color: #8D8D84; font-style: italic;">Debugging/Accounting ####</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">This tells Samba to use a separate log file for each machine</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">that connects</span>
   log file = /var/log/samba/log.%m

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Cap the size of the individual log files (in KiB).</span>
   max log size = 1000

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">We want Samba to log a minimum amount of information to syslog. Everything</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">should go to /var/log/samba/log.{smbd,nmbd} instead. If you want to log</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">through syslog you should set the following parameter to something higher.</span>
   syslog = 0

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Do something sensible when Samba crashes: mail the admin a backtrace</span>
   panic action = /usr/share/samba/panic-action %d


<span style="color: #8D8D84;">####### </span><span style="color: #8D8D84; font-style: italic;">Authentication #######</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">"security = user" is always a good idea. This will require a Unix account</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">in this server for every user accessing the server. See</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">/usr/share/doc/samba-doc/htmldocs/Samba3-HOWTO/ServerType.html</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">in the samba-doc package for details.</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">security = user</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">You may wish to use password encryption.  See the section on</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">'encrypt passwords' in the smb.conf(5) manpage before enabling.</span>
   encrypt passwords = true

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">If you are using encrypted passwords, Samba will need to know what</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">password database type you are using.  </span>
   passdb backend = tdbsam

   obey pam restrictions = yes

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">This boolean parameter controls whether Samba attempts to sync the Unix</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">password with the SMB password when the encrypted SMB password in the</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">passdb is changed.</span>
   unix password sync = yes

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For Unix password sync to work on a Debian GNU/Linux system, the following</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">parameters must be set (thanks to Ian Kahan &lt;<a href="mailto:kahan%40informatik.tu-muenchen.de">&lt;kahan@informatik.tu-muenchen.de&gt;</a> for</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">sending the correct chat script for the passwd program in Debian Sarge).</span>
   passwd program = /usr/bin/passwd %u
   passwd chat = <span style="color: #006699;">*Enter</span>\snew\s*\spassword:* %n\n <span style="color: #006699;">*Retype</span>\snew\s*\spassword:* %n\n <span style="color: #006699;">*password</span>\supdated\ssuccessfully* .

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">This boolean controls whether PAM will be used for password changes</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">when requested by an SMB client instead of the program listed in</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">'passwd program'. The default is 'no'.</span>
   pam password change = yes

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">This option controls how unsuccessful authentication attempts are mapped </span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">to anonymous connections</span>
   map to guest = bad user

{% if samba.windows_compatible %}
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">disable unix extensions and enable following symlinks</span>
   unix extensions = no
   follow symlinks= yes
   wide links= yes
{% endif %}
</pre>
</div>
</div></li>
<li><a id="org5021358"></a>media directories<br /><div class="outline-text-6" id="text-5-11-2-1-2">
<div class="org-src-container">
<pre class="src src-yaml">{% for name, path in media_dirs.iteritems() %}
[{{ name }}]
   path = {{ path }}
   comment = {{ name }} on %h
   guest ok = yes
   writeable = yes
   browseable = yes
   create mode = 0664
   directory mode = 0775
   force user = {{ vdr.user }}
   force group = {{ vdr.group }}
   follow symlinks = yes
   wide links = yes

{% endfor %}
</pre>
</div>
</div></li>
<li><a id="orgde1cf16"></a>include custom samba exports<br /><div class="outline-text-6" id="text-5-11-2-1-3">
<div class="org-src-container">
<pre class="src src-yaml">include = /etc/samba/smb.conf.custom
</pre>
</div>
</div></li></ol></li></ol>
</div>
</div>
<div id="outline-container-org1ffc256" class="outline-3">
<h3 id="org1ffc256"><span class="section-number-3">5.12</span> <span class="todo TODO">TODO</span> autoinstall-drivers</h3>
<div class="outline-text-3" id="text-5-12">
<p>
It would be nice to be able to detect if it is suitable to install those drivers:
</p>
</div>
<div id="outline-container-orga69d20e" class="outline-4">
<h4 id="orga69d20e"><span class="section-number-4">5.12.1</span> sundtek for Sundtek devices (local or network connection)</h4>
<div class="outline-text-4" id="text-5-12-1">
<p>
Vendor-IDs:
</p>
<ul class="org-ul">
<li>eb1a:5[1b2] (alte Generation)</li>
<li>2659:*      (neuere Sticks)</li>
</ul>
</div>
</div>
<div id="outline-container-org48b3305" class="outline-4">
<h4 id="org48b3305"><span class="section-number-4">5.12.2</span> dddvb-dkms if only newer DD cards are detected</h4>
</div>
<div id="outline-container-orgf21f8f0" class="outline-4">
<h4 id="orgf21f8f0"><span class="section-number-4">5.12.3</span> media-build-experimental (up to kernel 4.8) for &bdquo;old&ldquo; cards like TT S2-6400 FF</h4>
</div>
<div id="outline-container-orgfe9b70b" class="outline-4">
<h4 id="orgfe9b70b"><span class="section-number-4">5.12.4</span> newly merged DD drivers</h4>
<div class="outline-text-4" id="text-5-12-4">
<p>
from <a href="http://www.vdr-portal.de/board18-vdr-hardware/board102-dvb-karten/120817-treiber-der-cine-ctv6-ddbridge-ci-in-den-kernel-integrieren/">http://www.vdr-portal.de/board18-vdr-hardware/board102-dvb-karten/120817-treiber-der-cine-ctv6-ddbridge-ci-in-den-kernel-integrieren/</a>
</p>
</div>
</div>
</div>
