Manual.html

<div id="outline-container-orga5e72a8" class="outline-3">
<h3 id="orga5e72a8"><span class="section-number-3">5.13</span> autoinstall-satip</h3>
<div class="outline-text-3" id="text-5-13">
</div><div id="outline-container-org80a5f34" class="outline-4">
<h4 id="org80a5f34"><span class="section-number-4">5.13.1</span> tasks</h4>
<div class="outline-text-4" id="text-5-13-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file roles/autoinstall-satip/tasks/main.yml</span>

- <span style="color: #BA36A5;">name</span>: <span style="color: #008000;">"detect SAT&gt;IP Server(s) on the network"</span>
  <span style="color: #BA36A5;">action</span>: satip_facts

- <span style="color: #BA36A5;">debug</span>:
    <span style="color: #BA36A5;">var</span>: satip_detected
    <span style="color: #BA36A5;">verbosity</span>: 1

- <span style="color: #BA36A5;">name</span>: apt | install vdr-plugin-satip if a Sat&gt;IP server has been detected
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: vdr-plugin-satip
  <span style="color: #BA36A5;">when</span>: satip_detected
  <span style="color: #BA36A5;">notify</span>: [ <span style="color: #008000;">'Restart VDR'</span> ]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org50ca867" class="outline-3">
<h3 id="org50ca867"><span class="section-number-3">5.14</span> autoinstall-targavfd</h3>
<div class="outline-text-3" id="text-5-14">
</div><div id="outline-container-org3e8da56" class="outline-4">
<h4 id="org3e8da56"><span class="section-number-4">5.14.1</span> tasks</h4>
<div class="outline-text-4" id="text-5-14-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file roles/autoinstall-targavfd/tasks/main.yml</span>

- <span style="color: #BA36A5;">name</span>: apt | install vdr-plugin-targavfd if connected
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: vdr-plugin-targavfd
  <span style="color: #BA36A5;">when</span>: 
    - <span style="color: #008000;">'"19c2:6a11" in usb'</span>
  <span style="color: #BA36A5;">notify</span>: [ <span style="color: #008000;">'Restart VDR'</span> ]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2bff3e8" class="outline-3">
<h3 id="org2bff3e8"><span class="section-number-3">5.15</span> autoinstall-imonlcd</h3>
<div class="outline-text-3" id="text-5-15">
</div><div id="outline-container-org1c2ebfb" class="outline-4">
<h4 id="org1c2ebfb"><span class="section-number-4">5.15.1</span> tasks</h4>
<div class="outline-text-4" id="text-5-15-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file roles/autoinstall-imonlcd/tasks/main.yml</span>

- <span style="color: #BA36A5;">name</span>: apt | install vdr-plugin-imonlcd if connected
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: vdr-plugin-imonlcd
  <span style="color: #BA36A5;">when</span>: 
    - <span style="color: #008000;">'"15c2:0038" in usb'</span>
    - <span style="color: #008000;">'"15c2:ffdc" in usb'</span>
  <span style="color: #BA36A5;">notify</span>: [ <span style="color: #008000;">'Restart VDR'</span> ]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9ab978a" class="outline-3">
<h3 id="org9ab978a"><span class="section-number-3">5.16</span> autoinstall-libcecdaemon</h3>
<div class="outline-text-3" id="text-5-16">
</div><div id="outline-container-org07910a5" class="outline-4">
<h4 id="org07910a5"><span class="section-number-4">5.16.1</span> tasks</h4>
<div class="outline-text-4" id="text-5-16-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file roles/autoinstall-libcec-daemon/tasks/main.yml</span>

- <span style="color: #BA36A5;">name</span>: apt | install libcec-daemon if connected
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: libcec-daemon
  <span style="color: #BA36A5;">when</span>: 
    - <span style="color: #008000;">'"2548:1002" in usb'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb384b80" class="outline-3">
<h3 id="orgb384b80"><span class="section-number-3">5.17</span> autoinstall-pvr350</h3>
<div class="outline-text-3" id="text-5-17">
</div><div id="outline-container-org019b8ac" class="outline-4">
<h4 id="org019b8ac"><span class="section-number-4">5.17.1</span> tasks</h4>
<div class="outline-text-4" id="text-5-17-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file roles/autoinstall-pvr350/tasks/main.yml</span>

- <span style="color: #BA36A5;">name</span>: apt | install vdr-plugin-pvr350 if connected
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: vdr-plugin-pvr350
  <span style="color: #BA36A5;">when</span>: 
    - <span style="color: #008000;">'"0070:4000" in pci'</span>
  <span style="color: #BA36A5;">notify</span>: [ <span style="color: #008000;">'Restart VDR'</span> ]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge116f7a" class="outline-3">
<h3 id="orge116f7a"><span class="section-number-3">5.18</span> <span class="todo TODO">TODO</span> autoinstall-dvbhddevice</h3>
<div class="outline-text-3" id="text-5-18">
<p>
Problem: woher kommt der Treiber (AFAIK noch nicht im Kernel)? Die Firmware sollte in yavdr-firmware stecken
</p>
</div>
<div id="outline-container-org577ecea" class="outline-4">
<h4 id="org577ecea"><span class="section-number-4">5.18.1</span> tasks</h4>
<div class="outline-text-4" id="text-5-18-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file roles/autoinstall-dvbhddevice/tasks/main.yml</span>

- <span style="color: #BA36A5;">name</span>: apt | install vdr-plugin-dvbhddevice if connected
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: vdr-plugin-dvbhddevice
  <span style="color: #BA36A5;">when</span>: 
    - <span style="color: #008000;">'"13c2:300a" in pci'</span>
    - <span style="color: #008000;">'"13c2:300b" in pci'</span>
  <span style="color: #BA36A5;">notify</span>: [ <span style="color: #008000;">'Restart VDR'</span> ]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org37c5f6a" class="outline-3">
<h3 id="org37c5f6a"><span class="section-number-3">5.19</span> autoinstall-dvbsddevice</h3>
<div class="outline-text-3" id="text-5-19">
</div><div id="outline-container-orga6a09b0" class="outline-4">
<h4 id="orga6a09b0"><span class="section-number-4">5.19.1</span> tasks</h4>
<div class="outline-text-4" id="text-5-19-1">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">file roles/autoinstall-dvbsddevice/tasks/main.yml</span>

- <span style="color: #BA36A5;">name</span>: apt | install vdr-plugin-dvbsddevice if module is loaded
  <span style="color: #BA36A5;">apt</span>:
    <span style="color: #BA36A5;">name</span>: vdr-plugin-dvbsddevice
  <span style="color: #BA36A5;">when</span>: 
    - <span style="color: #008000;">'"dvb_ttpci" in modules'</span>
  <span style="color: #BA36A5;">notify</span>: [ <span style="color: #008000;">'Restart VDR'</span> ]
</pre>
</div>
</div>
</div>
</div>
