Manual.html
<div id="outline-container-org7296371" class="outline-3">
<h3 id="org7296371"><span class="section-number-3">5.20</span> template-test</h3>
<div class="outline-text-3" id="text-5-20">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #8D8D84; font-style: italic;">---</span>
- <span style="color: #BA36A5;">name</span>: show vars
  <span style="color: #BA36A5;">debug</span>: 
    <span style="color: #BA36A5;">var</span>: <span style="color: #008000;">'{{ system }}'</span>

- <span style="color: #BA36A5;">name</span>: test templates
  <span style="color: #BA36A5;">template</span>:
    <span style="color: #BA36A5;">src</span>: templates/test.j2
    <span style="color: #BA36A5;">dest</span>: /tmp/test.txt
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell">{{ ansible_managed_file | comment }}

Section <span style="color: #008000;">"ServerLayout"</span>
    Identifier     <span style="color: #008000;">"Layout0"</span>
    Screen      0  <span style="color: #008000;">"Screen0"</span>
    {% if system.x11.dualhead.enabled %}
    Screen      1  <span style="color: #008000;">"Screen1"</span> RightOf <span style="color: #008000;">"Screen0"</span>
    {% endif %}
    InputDevice    <span style="color: #008000;">"Keyboard0"</span> <span style="color: #008000;">"CoreKeyboard"</span>
    InputDevice    <span style="color: #008000;">"Mouse0"</span> <span style="color: #008000;">"CorePointer"</span>
EndSection

Section <span style="color: #008000;">"InputDevice"</span>
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">generated from default</span>
    Identifier     <span style="color: #008000;">"Mouse0"</span>
    Driver         <span style="color: #008000;">"mouse"</span>
    Option         <span style="color: #008000;">"Protocol"</span> <span style="color: #008000;">"auto"</span>
    Option         <span style="color: #008000;">"Device"</span> <span style="color: #008000;">"/dev/psaux"</span>
    Option         <span style="color: #008000;">"Emulate3Buttons"</span> <span style="color: #008000;">"no"</span>
    Option         <span style="color: #008000;">"ZAxisMapping"</span> <span style="color: #008000;">"4 5"</span>
EndSection


Section <span style="color: #008000;">"InputDevice"</span>
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">generated from default</span>
    Identifier     <span style="color: #008000;">"Keyboard0"</span>
    Driver         <span style="color: #008000;">"kbd"</span>
EndSection


Section <span style="color: #008000;">"Monitor"</span>
    Identifier     <span style="color: #008000;">"Monitor0"</span>
    VendorName     <span style="color: #008000;">"Unknown"</span>
    ModelName      <span style="color: #008000;">"Unknown"</span>
{% if system.x11.display.0.default == <span style="color: #008000;">"VGA2Scart_4_3"</span> or system.x11.display.0.default == <span style="color: #008000;">"VGA2Scart_16_9"</span> %}
    HorizSync       14-17
    VertRefresh     49-61
    {% if system.x11.display.0.default == <span style="color: #008000;">"VGA2Scart_4_3"</span> %}
    Modeline <span style="color: #008000;">"VGA2Scart_4_3"</span> 13.875 720 744 808 888 576 580 585 625 -HSync -Vsync interlace
    {% elif system.x11.display.0.default == <span style="color: #008000;">"VGA2Scart_16_9"</span> %}
    Modeline <span style="color: #008000;">"VGA2Scart_16_9"</span> 19 1024 1032 1120 1216 576 581 586 625 -Hsync -Vsync interlace
    {% endif %}
{% endif %}
    Option         <span style="color: #008000;">"DPMS"</span>
    Option         <span style="color: #008000;">"ExactModeTimingsDVI"</span> <span style="color: #008000;">"True"</span>
EndSection


{% if system.x11.dualhead.enabled == <span style="color: #008000;">"1"</span> %}
Section <span style="color: #008000;">"Monitor"</span>
    Identifier     <span style="color: #008000;">"Monitor1"</span>
    VendorName     <span style="color: #008000;">"Unknown"</span>
    ModelName      <span style="color: #008000;">"Unknown"</span>
{% if system.x11.display.1.default<span style="color: #0000FF;"> in</span> (<span style="color: #008000;">"VGA2Scart_4_3"</span>,  <span style="color: #008000;">"VGA2Scart_16_9"</span>) %}
    HorizSync       14-17
    VertRefresh     49-61
    {% if system.x11.display.1.default == <span style="color: #008000;">"VGA2Scart_4_3"</span> %}
    Modeline <span style="color: #008000;">"VGA2Scart_4_3"</span> 13.875 720 744 808 888 576 580 585 625 -HSync -Vsync interlace
    {% elif system.x11.display.1.default == <span style="color: #008000;">"VGA2Scart_16_9"</span> %}
    Modeline <span style="color: #008000;">"VGA2Scart_16_9"</span> 19 1024 1032 1120 1216 576 581 586 625 -Hsync -Vsync interlace
    {% endif %}
    Option         <span style="color: #008000;">"DPMS"</span>
    Option         <span style="color: #008000;">"ExactModeTimingsDVI"</span> <span style="color: #008000;">"True"</span>
{% endif %}
EndSection
{% endif %}

Section <span style="color: #008000;">"Device"</span>
    Identifier     <span style="color: #008000;">"Device0"</span>
{% if system.hardware.nvidia.detected %}
    Driver         <span style="color: #008000;">"nvidia"</span>
    VendorName     <span style="color: #008000;">"NVIDIA Corporation"</span>
{% endif %}
    Screen          0
    Option         <span style="color: #008000;">"DPI"</span> <span style="color: #008000;">"100x100"</span>
{% if system.hardware.nvidia.busid %}
    BusID          <span style="color: #008000;">"PCI: {{ system.hardware.nvidia.busid }}"</span>
{% endif %}
    Option         <span style="color: #008000;">"NoLogo"</span> <span style="color: #008000;">"True"</span>
    Option         <span style="color: #008000;">"UseEvents"</span> <span style="color: #008000;">"True"</span>
    Option         <span style="color: #008000;">"TripleBuffer"</span> <span style="color: #008000;">"False"</span>
    Option         <span style="color: #008000;">"AddARGBGLXVisuals"</span> <span style="color: #008000;">"True"</span>
    Option         <span style="color: #008000;">"TwinView"</span> <span style="color: #008000;">"0"</span>
    Option         <span style="color: #008000;">"DynamicTwinView"</span> <span style="color: #008000;">"0"</span>
    Option         <span style="color: #008000;">"OnDemandVBlankinterrupts"</span> <span style="color: #008000;">"on"</span>
    Option         <span style="color: #008000;">"FlatPanelProperties"</span> <span style="color: #008000;">"Scaling = Native"</span>
EndSection

{% if system.x11.dualhead.enabled == <span style="color: #008000;">"1"</span> %}
Section <span style="color: #008000;">"Device"</span>
    Identifier     <span style="color: #008000;">"Device1"</span>
    {% if system.hardware.nvidia.detected %}
    Driver         <span style="color: #008000;">"nvidia"</span>
    VendorName     <span style="color: #008000;">"NVIDIA Corporation"</span>
    {% endif %}
    Screen          1
    {% if system.hardware.nvidia.busid %}
    BusID          <span style="color: #008000;">"PCI: {{ system.hardware.nvidia.busid }}"</span>
    {% endif %}
    Option         <span style="color: #008000;">"NoLogo"</span> <span style="color: #008000;">"True"</span>
    Option         <span style="color: #008000;">"UseEvents"</span> <span style="color: #008000;">"True"</span>
    Option         <span style="color: #008000;">"TripleBuffer"</span> <span style="color: #008000;">"False"</span>
    Option         <span style="color: #008000;">"AddARGBGLXVisuals"</span> <span style="color: #008000;">"True"</span>
    Option         <span style="color: #008000;">"TwinView"</span> <span style="color: #008000;">"0"</span>
    Option         <span style="color: #008000;">"DynamicTwinView"</span> <span style="color: #008000;">"0"</span>
EndSection
{% endif %}


Section <span style="color: #008000;">"Screen"</span>
    Identifier     <span style="color: #008000;">"Screen0"</span>
    Device         <span style="color: #008000;">"Device0"</span>
    Monitor        <span style="color: #008000;">"Monitor0"</span>
    DefaultDepth    24
    SubSection     <span style="color: #008000;">"Display"</span>
        Depth       24
{% if system.x11.display.0.default is defined and system.x11.display.0.default %}
        Modes      <span style="color: #008000;">"{{ system.x11.display.0.default }}"</span>{% for mode<span style="color: #0000FF;"> in</span> system.x11.display.0.mode %}{% if mode != system.x11.display.0.default %} <span style="color: #008000;">"{{ mode }}"</span>{% endif %}{% endfor %}

{% elif system.hardware.nvidia.detected == 1 %}
        Modes      <span style="color: #008000;">"nvidia-auto-select"</span>
{% endif %}
    EndSubSection
{% if system.x11.display.0.default or system.x11.default %}
    {% if system.x11.display.0.device is definded and system.x11.display.0.device %}
    Option         <span style="color: #008000;">"ConnectedMonitor"</span> {{ system.x11.display.0.device }}
    {% else %}
    Option         <span style="color: #008000;">"ConnectedMonitor"</span> {{ system.x11.default }}
    {% endif %}
    <span style="color: #8D8D84;">#     </span><span style="color: #8D8D84; font-style: italic;">Option         "ConnectedMonitor" "&lt;?cs if:(?system.x11.display.0.device) ?&gt;&lt;?cs call:fix_display_name(system.x11.display.0.device) ?&gt;&lt;?cs else ?&gt;&lt;?cs var:system.x11.default ?&gt;&lt;?cs /if ?&gt;&lt;?cs if:(?system.x11.dualhead.enabled &amp;&amp; system.x11.dualhead.enabled == 1) ?&gt;, &lt;?cs call:fix_display_name(system.x11.display.1.device) ?&gt;&lt;?cs /if ?&gt;"</span>
    <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">Option         "ConnectedMonitor"</span>
    <span style="color: #008000;">"&lt;?cs if:(?system.x11.display.0.device) ?&gt;</span>
<span style="color: #008000;">          &lt;?cs call:fix_display_name(system.x11.display.0.device) ?&gt;</span>
<span style="color: #008000;">     &lt;?cs else ?&gt;</span>
<span style="color: #008000;">          &lt;?cs var:system.x11.default ?&gt;</span>
<span style="color: #008000;">     &lt;?cs /if ?&gt;</span>
<span style="color: #008000;">     &lt;?cs if:(?system.x11.dualhead.enabled &amp;&amp; system.x11.dualhead.enabled == 1) ?&gt;, &lt;?cs call:fix_display_name(system.x11.display.1.device) ?&gt;&lt;?cs /if ?&gt;"</span>
<span style="color: #8D8D84;">#     </span><span style="color: #8D8D84; font-style: italic;">Option         "UseDisplayDevice" "&lt;?cs if:(?system.x11.display.0.device) ?&gt;&lt;?cs call:fix_display_name(system.x11.display.0.device) ?&gt;&lt;?cs else ?&gt;&lt;?cs var:system.x11.default ?&gt;&lt;?cs /if ?&gt;"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs /if ?&gt;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs if:(?system.hardware.nvidia.0.edid &amp;&amp; system.hardware.nvidia.0.edid == "1") ?&gt;</span>
<span style="color: #8D8D84;">#     </span><span style="color: #8D8D84; font-style: italic;">Option         "CustomEDID" "&lt;?cs call:fix_display_name(system.x11.display.0.device) ?&gt;:/etc/X11/edid.0.yavdr"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs /if ?&gt;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs if:(system.hardware.nvidia.detected == 1 &amp;&amp; ?system.x11.display.0.device) ?&gt;</span>
<span style="color: #8D8D84;">#     </span><span style="color: #8D8D84; font-style: italic;">Option          "MetaModes" "&lt;?cs call:fix_display_name(system.x11.display.0.device) ?&gt;: &lt;?cs var:system.x11.display.0.default ?&gt; { ViewPortIn=&lt;?cs var:system.x11.display.0.viewport.in.x ?&gt;x&lt;?cs var:system.x11.display.0.viewport.in.y ?&gt;, ViewPortOut=&lt;?cs var:system.x11.display.0.viewport.out.x ?&gt;x&lt;?cs var:system.x11.display.0.viewport.out.y ?&gt;+&lt;?cs var:system.x11.display.0.viewport.out.plusx ?&gt;+&lt;?cs var:system.x11.display.0.viewport.out.plusy ?&gt; }"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs each:mode = system.x11.display.0.mode ?&gt;&lt;?cs if:(mode != system.x11.display.0.default) ?&gt;</span>
<span style="color: #8D8D84;">#     </span><span style="color: #8D8D84; font-style: italic;">Option          "MetaModes" "&lt;?cs call:fix_display_name(system.x11.display.0.device) ?&gt;: &lt;?cs var:mode ?&gt; { ViewPortIn=&lt;?cs var:system.x11.display.0.viewport.in.x ?&gt;x&lt;?cs var:system.x11.display.0.viewport.in.y ?&gt;, ViewPortOut=&lt;?cs var:system.x11.display.0.viewport.out.x ?&gt;x&lt;?cs var:system.x11.display.0.viewport.out.y ?&gt;+&lt;?cs var:system.x11.display.0.viewport.out.plusx ?&gt;+&lt;?cs var:system.x11.display.0.viewport.out.plusy ?&gt; }"&lt;?cs /if ?&gt;&lt;?cs /each ?&gt; </span>
{% endif %}
EndSection

{% if system.x11.dualhead.enabled == <span style="color: #008000;">"1"</span> %}
Section <span style="color: #008000;">"Screen"</span>

     Identifier     <span style="color: #008000;">"Screen1"</span>
     Device         <span style="color: #008000;">"Device1"</span>
     Monitor        <span style="color: #008000;">"Monitor1"</span>
     DefaultDepth    24
     SubSection     <span style="color: #008000;">"Display"</span>
         Depth       24
{% if system.x11.display.0.default is defined and system.x11.display.0.default %}
         Modes      <span style="color: #008000;">"{{ system.x11.display.1.default }}"</span>{% for mode<span style="color: #0000FF;"> in</span> system.x11.display.1.mode %}{% if mode != system.x11.display.1.default %} <span style="color: #008000;">"{{ mode }}"</span>{% endif %}{% endfor %}

{% elif system.hardware.nvidia.detected == <span style="color: #008000;">"1"</span> %}
         Modes      <span style="color: #008000;">"nvidia-auto-select"</span>
{% endif %}
      EndSubSection

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs if:(?system.x11.display.1.default &amp;&amp; system.x11.display.1.default != "" &amp;&amp; system.x11.display.1.default != "disabled") ?&gt;</span>
<span style="color: #8D8D84;">#     </span><span style="color: #8D8D84; font-style: italic;">Option         "UseDisplayDevice" "&lt;?cs call:fix_display_name(system.x11.display.1.device) ?&gt;"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs /if ?&gt;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs if:(?system.hardware.nvidia.1.edid &amp;&amp; system.hardware.nvidia.1.edid == "1") ?&gt;</span>
<span style="color: #8D8D84;">#     </span><span style="color: #8D8D84; font-style: italic;">Option         "CustomEDID" "&lt;?cs call:fix_display_name(system.x11.display.1.device) ?&gt;:/etc/X11/edid.1.yavdr"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs /if ?&gt;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs if:(system.hardware.nvidia.detected == 1 &amp;&amp; ?system.x11.display.1.device) ?&gt;</span>
<span style="color: #8D8D84;">#     </span><span style="color: #8D8D84; font-style: italic;">Option          "MetaModes" "&lt;?cs call:fix_display_name(system.x11.display.1.device) ?&gt;: &lt;?cs var:system.x11.display.1.default ?&gt; { ViewPortIn=&lt;?cs var:system.x11.display.1.viewport.in.x ?&gt;x&lt;?cs var:system.x11.display.1.viewport.in.y ?&gt;, ViewPortOut=&lt;?cs var:system.x11.display.1.viewport.out.x ?&gt;x&lt;?cs var:system.x11.display.1.viewport.out.y ?&gt;+&lt;?cs var:system.x11.display.1.viewport.out.plusx ?&gt;+&lt;?cs var:system.x11.display.1.viewport.out.plusy ?&gt; }"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs each:mode = system.x11.display.1.mode ?&gt;&lt;?cs if:(mode != system.x11.display.1.default) ?&gt;</span>
<span style="color: #8D8D84;">#     </span><span style="color: #8D8D84; font-style: italic;">Option          "MetaModes" "&lt;?cs call:fix_display_name(system.x11.display.1.device) ?&gt;: &lt;?cs var:mode ?&gt; { ViewPortIn=&lt;?cs var:system.x11.display.1.viewport.in.x ?&gt;x&lt;?cs var:system.x11.display.1.viewport.in.y ?&gt;, ViewPortOut=&lt;?cs var:system.x11.display.1.viewport.out.x ?&gt;x&lt;?cs var:system.x11.display.1.viewport.out.y ?&gt;+&lt;?cs var:system.x11.display.1.viewport.out.plusx ?&gt;+&lt;?cs var:system.x11.display.1.viewport.out.plusy ?&gt; }"&lt;?cs /if ?&gt;&lt;?cs /each ?&gt;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&lt;?cs /if ?&gt;</span>
EndSection
{% endif %}

Section <span style="color: #008000;">"Extensions"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">if no open-gl OSD is needed (e.g. for vdr-sxfe):</span>
    Option         <span style="color: #008000;">"Composite"</span> <span style="color: #008000;">"Disable"</span>
EndSection
</pre>
</div>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">foo</span>:
  - bar
  - baz
  - spam

<span style="color: #BA36A5;">system</span>:
  <span style="color: #BA36A5;">hardware</span>:
    <span style="color: #BA36A5;">nvidia</span>:
      <span style="color: #BA36A5;">detected</span>: <span style="color: #008000;">"1"</span>
      <span style="color: #BA36A5;">busid</span>: <span style="color: #008000;">"000:2304:234"</span>
  <span style="color: #BA36A5;">x11</span>:
    <span style="color: #BA36A5;">dualhead</span>:
      <span style="color: #BA36A5;">enabled</span>: <span style="color: #008000;">"0"</span>
    <span style="color: #BA36A5;">display</span>:
      <span style="color: #BA36A5;">0</span>:
        <span style="color: #BA36A5;">mode</span>:
          - <span style="color: #008000;">"1920x1080_50"</span>
        <span style="color: #BA36A5;">default</span>: <span style="color: #008000;">"nvidia-auto"</span>

      <span style="color: #BA36A5;">1</span>:
        <span style="color: #BA36A5;">mode</span>:
          - <span style="color: #008000;">"1280x720_60"</span>
</pre>
</div>
</div>
</div>
