Manual.html
<div id="outline-container-org842d393" class="outline-3">
<h3 id="org842d393"><span class="section-number-3">6.1</span> hardware_facts.py</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">!/usr/bin/env python</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">This Module collects the vendor- and device ids for USB- and PCI(e)-devices and currently loaded kernel modules.</span>
<span style="color: #BA36A5;">DOCUMENTATION</span> = <span style="color: #008000;">'''</span>
<span style="color: #008000;">---</span>
<span style="color: #008000;">module: hardware_facts</span>
<span style="color: #008000;">short_description: collects facts for kernel modules, usb and pci devices</span>
<span style="color: #008000;">description:</span>
<span style="color: #008000;">     - This Module collects the vendor- and device ids for USB- and PCI(e)-devices and</span>
<span style="color: #008000;">       currently loaded kernel modules.</span>
<span style="color: #008000;">options:</span>
<span style="color: #008000;">    usb:</span>
<span style="color: #008000;">        required: False</span>
<span style="color: #008000;">        default: True</span>
<span style="color: #008000;">        description:</span>
<span style="color: #008000;">          - return a list of vendor- and device ids for usb devices in '04x:04x' notation</span>

<span style="color: #008000;">    pci:</span>
<span style="color: #008000;">        required: False</span>
<span style="color: #008000;">        default: True</span>
<span style="color: #008000;">        description:</span>
<span style="color: #008000;">          - return a list of vendor- and device ids for pci devices in '04x:04x' notation</span>

<span style="color: #008000;">    modules:</span>
<span style="color: #008000;">        required: False</span>
<span style="color: #008000;">        default: True</span>
<span style="color: #008000;">        description:</span>
<span style="color: #008000;">          - return a list of currently loaded kernel modules</span>

<span style="color: #008000;">    gpus:</span>
<span style="color: #008000;">        required: False</span>
<span style="color: #008000;">        default: True</span>
<span style="color: #008000;">        description:</span>
<span style="color: #008000;">          - return a list of devices of the pci gpu class (0x030000)</span>
<span style="color: #008000;">notes:</span>
<span style="color: #008000;">   - requres python-pyusb and python-kmodpy</span>
<span style="color: #008000;">requirements: [ ]</span>
<span style="color: #008000;">author: "Alexander Grothe <a href="mailto:seahawk1986%40gmx.de">&lt;seahawk1986@gmx.de&gt;</a>"</span>
<span style="color: #008000;">'''</span>

<span style="color: #BA36A5;">EXAMPLES</span> = <span style="color: #008000;">'''</span>
<span style="color: #008000;">- name: get information about usb and pci hardware and loaded kernel modules</span>
<span style="color: #008000;">  hardware_facts:</span>
<span style="color: #008000;">    usb: True</span>
<span style="color: #008000;">    pci: True</span>
<span style="color: #008000;">    modules: True</span>
<span style="color: #008000;">- debug:</span>
<span style="color: #008000;">    var: usb</span>
<span style="color: #008000;">- debug</span>
<span style="color: #008000;">    var: pci</span>
<span style="color: #008000;">- debug</span>
<span style="color: #008000;">    var: modules</span>
<span style="color: #008000;">- debug</span>
<span style="color: #008000;">    var: gpus</span>
<span style="color: #008000;">'''</span>

<span style="color: #0000FF;">import</span> glob
<span style="color: #0000FF;">import</span> json
<span style="color: #0000FF;">import</span> os
<span style="color: #0000FF;">import</span> sys
<span style="color: #0000FF;">import</span> usb.core
<span style="color: #0000FF;">from</span> collections <span style="color: #0000FF;">import</span> namedtuple

<span style="color: #0000FF;">import</span> kmodpy
<span style="color: #0000FF;">from</span> ansible.module_utils.basic <span style="color: #0000FF;">import</span> *


<span style="color: #BA36A5;">PCIDevice</span> = namedtuple(<span style="color: #008000;">"PCIDevice"</span>, [<span style="color: #008000;">'idVendor'</span>, <span style="color: #008000;">'idProduct'</span>, <span style="color: #008000;">'idClass'</span>])

<span style="color: #0000FF;">def</span> <span style="color: #006699;">get_pci_devices</span>():
    <span style="color: #0000FF;">for</span> device <span style="color: #0000FF;">in</span> glob.glob(<span style="color: #008000;">'/sys/devices/pci*/*:*:*/'</span>):
        <span style="color: #0000FF;">with</span> <span style="color: #006FE0;">open</span>(os.path.join(device, <span style="color: #008000;">'device'</span>)) <span style="color: #0000FF;">as</span> d:
            <span style="color: #BA36A5;">product_id</span> = <span style="color: #006FE0;">int</span>(d.read().strip(), 16)
        <span style="color: #0000FF;">with</span> <span style="color: #006FE0;">open</span>(os.path.join(device, <span style="color: #008000;">'vendor'</span>)) <span style="color: #0000FF;">as</span> d:
            <span style="color: #BA36A5;">vendor_id</span> = <span style="color: #006FE0;">int</span>(d.read().strip(), 16)
        <span style="color: #0000FF;">with</span> <span style="color: #006FE0;">open</span>(os.path.join(device, <span style="color: #008000;">'class'</span>)) <span style="color: #0000FF;">as</span> d:
            <span style="color: #BA36A5;">class_id</span> = <span style="color: #006FE0;">int</span>(d.read().strip(), 16)
        <span style="color: #0000FF;">yield</span> PCIDevice(idVendor=vendor_id, idProduct=product_id, idClass=class_id)

<span style="color: #0000FF;">def</span> <span style="color: #006699;">format_device_list</span>(iterator):
    <span style="color: #0000FF;">return</span> [<span style="color: #008000;">"{:04x}:{:04x}"</span>.<span style="color: #006FE0;">format</span>(d.idVendor, d.idProduct) <span style="color: #0000FF;">for</span> d <span style="color: #0000FF;">in</span> iterator]

<span style="color: #0000FF;">def</span> <span style="color: #006699;">format_gpu_device_list</span>(iterator):
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">get_entries</span>(iterator):
        <span style="color: #0000FF;">for</span> d <span style="color: #0000FF;">in</span> iterator:
            <span style="color: #0000FF;">if</span> d.idClass == 0x030000:
                <span style="color: #0000FF;">yield</span> (<span style="color: #008000;">"{:04x}:{:04x}"</span>.<span style="color: #006FE0;">format</span>(d.idVendor, d.idProduct))
    <span style="color: #0000FF;">return</span> [entry <span style="color: #0000FF;">for</span> entry <span style="color: #0000FF;">in</span> get_entries(iterator)]

<span style="color: #BA36A5;">arg_specs</span> = {
    <span style="color: #008000;">'usb'</span>: <span style="color: #006FE0;">dict</span>(default=<span style="color: #D0372D;">True</span>, <span style="color: #006FE0;">type</span>=<span style="color: #008000;">'bool'</span>, required=<span style="color: #D0372D;">False</span>),
    <span style="color: #008000;">'pci'</span>: <span style="color: #006FE0;">dict</span>(default=<span style="color: #D0372D;">True</span>, <span style="color: #006FE0;">type</span>=<span style="color: #008000;">'bool'</span>, required=<span style="color: #D0372D;">False</span>),
    <span style="color: #008000;">'modules'</span>: <span style="color: #006FE0;">dict</span>(default=<span style="color: #D0372D;">True</span>, <span style="color: #006FE0;">type</span>=<span style="color: #008000;">'bool'</span>, required=<span style="color: #D0372D;">False</span>),
    <span style="color: #008000;">'gpus'</span>: <span style="color: #006FE0;">dict</span>(default=<span style="color: #D0372D;">True</span>, <span style="color: #006FE0;">type</span>=<span style="color: #008000;">'bool'</span>, required=<span style="color: #D0372D;">False</span>),
    }


<span style="color: #0000FF;">def</span> <span style="color: #006699;">main</span>():
    <span style="color: #BA36A5;">module</span> = AnsibleModule(argument_spec=arg_specs, supports_check_mode=<span style="color: #D0372D;">True</span>,)
    <span style="color: #BA36A5;">collect_usb</span> = module.params[<span style="color: #008000;">'usb'</span>]
    <span style="color: #BA36A5;">collect_pci</span> = module.params[<span style="color: #008000;">'pci'</span>]
    <span style="color: #BA36A5;">collect_modules</span> = module.params[<span style="color: #008000;">'modules'</span>]
    <span style="color: #BA36A5;">collect_gpus</span> = module.params[<span style="color: #008000;">'gpus'</span>]
    <span style="color: #0000FF;">if</span> collect_usb:
        <span style="color: #BA36A5;">usb_devices</span> = format_device_list(usb.core.find(find_all=<span style="color: #D0372D;">True</span>))
    <span style="color: #0000FF;">else</span>:
        <span style="color: #BA36A5;">usb_device</span> = []
    <span style="color: #0000FF;">if</span> collect_pci:
        <span style="color: #BA36A5;">pci_devices</span> = format_device_list(get_pci_devices())
    <span style="color: #0000FF;">else</span>:
        <span style="color: #BA36A5;">pci_devices</span> = []
    <span style="color: #0000FF;">if</span> collect_modules:
        <span style="color: #BA36A5;">k</span> = kmodpy.Kmod()
        <span style="color: #BA36A5;">modules</span> = [m[0] <span style="color: #0000FF;">for</span> m <span style="color: #0000FF;">in</span> k.loaded()]
    <span style="color: #0000FF;">else</span>:
        <span style="color: #BA36A5;">modules</span> = []
    <span style="color: #0000FF;">if</span> collect_gpus:
        <span style="color: #BA36A5;">gpus</span> = format_gpu_device_list(get_pci_devices())
    <span style="color: #0000FF;">else</span>:
        <span style="color: #BA36A5;">gpus</span> = []
    <span style="color: #BA36A5;">data</span> = {<span style="color: #008000;">'usb'</span>: usb_devices, <span style="color: #008000;">'pci'</span>: pci_devices, <span style="color: #008000;">'modules'</span>: modules, <span style="color: #008000;">'gpus'</span>: gpus}
    module.exit_json(changed=<span style="color: #D0372D;">False</span>, ansible_facts=data, msg=data)


<span style="color: #0000FF;">if</span> <span style="color: #006FE0;">__name__</span> == <span style="color: #008000;">'__main__'</span>:  
    main()
</pre>
</div>
</div>
</div>
