Manual.html
<div id="outline-container-orgf75575d" class="outline-3">
<h3 id="orgf75575d"><span class="section-number-3">6.2</span> satip_facts.py</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">!/usr/bin/env python2</span>

<span style="color: #BA36A5;">DOCUMENTATION</span> = <span style="color: #008000;">'''</span>
<span style="color: #008000;">---</span>
<span style="color: #008000;">module: hardware_facts</span>
<span style="color: #008000;">short_description: "check if at least one SAT&gt;IP server responds on the network"</span>
<span style="color: #008000;">description:</span>
<span style="color: #008000;">     - This script sends a multicast message and awaits responses by Sat&gt;IP servers.</span>
<span style="color: #008000;">       Returns the boolean variable 'satip_detected'</span>
<span style="color: #008000;">'''</span>
<span style="color: #BA36A5;">EXAMPLES</span> = <span style="color: #008000;">'''</span>
<span style="color: #008000;">- name: "detect SAT&gt;IP Server on the network"</span>
<span style="color: #008000;">  action: satip_facts</span>

<span style="color: #008000;">- debug:</span>
<span style="color: #008000;">    var: satip_detected</span>
<span style="color: #008000;">'''</span>

<span style="color: #0000FF;">import</span> json
<span style="color: #0000FF;">import</span> socket
<span style="color: #0000FF;">import</span> sys
<span style="color: #0000FF;">import</span> time

<span style="color: #0000FF;">from</span> ansible.module_utils.basic <span style="color: #0000FF;">import</span> *

<span style="color: #BA36A5;">SSDP_ADDR</span> = <span style="color: #008000;">"239.255.255.250"</span>
<span style="color: #BA36A5;">SSDP_PORT</span> = 1900
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">SSDP_MX = max delay for server response</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">a value of 2s is recommended by the SAT&gt;IP specification 1.2.2</span>
<span style="color: #BA36A5;">SSDP_MX</span> = 2
<span style="color: #BA36A5;">SSDP_ST</span> = <span style="color: #008000;">"urn:ses-com:device:SatIPServer:1"</span>

<span style="color: #BA36A5;">ssdpRequest</span> = <span style="color: #008000;">"\r\n"</span>.join((
    <span style="color: #008000;">"M-SEARCH * HTTP/1.1"</span>,
    <span style="color: #008000;">"HOST: %s:%d"</span> % (SSDP_ADDR, SSDP_PORT),
    <span style="color: #008000;">"MAN: \"ssdp:discover\""</span>,
    <span style="color: #008000;">"MX: %d"</span> % (SSDP_MX),
    <span style="color: #008000;">"ST: %s"</span> % (SSDP_ST),
    <span style="color: #008000;">"\r\n"</span>))

<span style="color: #0000FF;">def</span> <span style="color: #006699;">main</span>():
    <span style="color: #BA36A5;">module</span> = AnsibleModule(argument_spec={}, supports_check_mode=<span style="color: #D0372D;">True</span>,)
    <span style="color: #BA36A5;">sock</span> = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">according to Sat&gt;IP Specification 1.2.2, p. 20</span>
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">a client should send three requests within 100 ms with a ttl of 2</span>
    sock.setsockopt(socket.IPPROTO_IP, socket.IP_MULTICAST_TTL, 2)
    sock.settimeout(SSDP_MX + 0.5)
    <span style="color: #0000FF;">for</span> _ <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(3):
        sock.sendto(ssdpRequest, (SSDP_ADDR, SSDP_PORT))
        time.sleep(0.03)
    <span style="color: #0000FF;">try</span>:
        <span style="color: #BA36A5;">response</span> = sock.recv(1000)
        <span style="color: #0000FF;">if</span> response <span style="color: #0000FF;">and</span> <span style="color: #008000;">"SERVER:"</span> <span style="color: #0000FF;">in</span> response:
            <span style="color: #BA36A5;">got_response</span> = <span style="color: #D0372D;">True</span>
        <span style="color: #0000FF;">else</span>:
            <span style="color: #0000FF;">raise</span> <span style="color: #6434A3;">ValueError</span>(<span style="color: #008000;">'No satip server detected'</span>)
    <span style="color: #0000FF;">except</span> (socket.timeout, <span style="color: #6434A3;">ValueError</span>):
        <span style="color: #BA36A5;">got_response</span> = <span style="color: #D0372D;">False</span>

    module.exit_json(changed=<span style="color: #D0372D;">False</span>, ansible_facts={<span style="color: #008000;">'satip_detected'</span>: got_response})

<span style="color: #0000FF;">if</span> <span style="color: #006FE0;">__name__</span> == <span style="color: #008000;">'__main__'</span>:  
    main()
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9372885" class="outline-2">
<h2 id="org9372885"><span class="section-number-2">7</span> Handlers</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #BA36A5;">name</span>: Restart Samba
  <span style="color: #BA36A5;">systemd</span>:
    <span style="color: #BA36A5;">name</span>: smbd.service
    <span style="color: #BA36A5;">state</span>: restarted
    <span style="color: #BA36A5;">enabled</span>: <span style="color: #D0372D;">yes</span>
    <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">masked: no</span>
  <span style="color: #BA36A5;">register</span>: samba_reload

- <span style="color: #BA36A5;">name</span>: Restart NFS Kernel Server
  <span style="color: #BA36A5;">systemd</span>:
    <span style="color: #BA36A5;">name</span>: nfs-server.service
    <span style="color: #BA36A5;">state</span>: restarted
    <span style="color: #BA36A5;">enabled</span>: <span style="color: #D0372D;">yes</span>
    <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">masked: no</span>
  <span style="color: #BA36A5;">register</span>: nfs_reload

- <span style="color: #BA36A5;">name</span>: Restart VDR
  <span style="color: #BA36A5;">systemd</span>:
    <span style="color: #BA36A5;">name</span>: vdr.service
    <span style="color: #BA36A5;">state</span>: restarted
    <span style="color: #BA36A5;">enabled</span>: <span style="color: #D0372D;">yes</span>
  <span style="color: #BA36A5;">register</span>: vdr_restart
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Alexander Grothe</p>
<p class="date">Created: 2017-03-17 Fr 11:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
